<div class="title">
        Добро пожаловать на образовательный сайт по логическому программированию средствами JavaScript
    </div>
<div class="container">
    <div>
        <img class="var" src="/Picture/Variable.svg" alt="">
        Руководство по JavaScript - В этом разделе вы найдете всю нужную информацию для всех уровней знания языка. Подойдет как новичку так и профессионалу.
    </div>
    <div>
        <img class="var" src="/Picture/Variable.svg" alt="">
        Практика - В этом разделе вы можете потренироваться выполняя тесты на знания языка программирования JavaScript и получая за это балы которые 
        можно отслеживать в личном кабинете пользователя.
    </div>
    <div>
        <img class="var" src="/Picture/Variable.svg" alt="">
        О сайте - Здесь вы найдете контактную информацию для связи с авторами
    </div>
</div>