<div class="title">
    Руководство по JavaScript
</div>
<div class="container">
    <div>
        <b>Глава 1. Введение в JavaScript</b>
        <ul>
            <li>Что такое JavaScript</li>
            <li>Первая программа на JavaScript</li>
            <li>Выполнение кода javascript</li>
            <li>Подключение внешнего файла JavaScript</li>
            <li>Консоль браузера и console.log</li>
        </ul>
    </div>
    <div>
        <b>Глава 2. Основы javascript</b>
        <ul>
            <li>Переменные и константы</li>
            <li>Типы данных</li>
            <li>Арифметические операции</li>
            <li>Поразрядные операции</li>
            <li>Условные выражения</li>
            <li>Условные операторы ?: и ??</li>
            <li>Преобразование данных</li>
            <li>Введение в массивы</li>
            <li>Условные конструкции</li>
            <li>Циклы</li>
            <li>Отладка и отладчик</li>
        </ul>
    </div>
    <div>
        <b>Глава 3. Функциональное программирование</b>
        <ul>
            <li>Функции</li>
            <li>Параметры функции</li>
            <li>Результат функции</li>
            <li>Стрелочные функции</li>
            <li>Область видимости переменных</li>
            <li>Замыкания</li>
            <li>Функции IIFE</li>
            <li>Рекурсивные функции</li>
            <li>Переопределение функций</li>
            <li>Hoisting</li>
            <li>Передача параметров по значению и по ссылке</li>
        </ul>
    </div>
    <div>
        <b>Глава 4. Объектно-ориентированное программирование</b>
        <ul>
            <li>Объекты</li>
            <li>Ключевое слово this</li>
            <li>Вложенные объекты и массивы в объектах</li>
            <li>Копирование и сравнение объектов</li>
            <li>Проверка наличия и перебор методов и свойств</li>
            <li>Объекты в функциях</li>
            <li>Функции-конструкторы объектов</li>
            <li>Расширение объектов. Прототипы</li>
            <li>Функция как объект. Методы call и apply</li>
            <li>Функция Object.create. Конфигурация свойств объектов</li>
            <li>Наследование прототипов</li>
            <li>Наследование прототипов конструкторов</li>
            <li>Инкапсуляция свойств. Геттеры и сеттеры</li>
            <li>Деструктуризация</li>
            <li>Оператор ?.</li>
            <li>Константные объекты. Запрет изменения объекта</li>
        </ul>
    </div>
    <div>
        <b>Глава 5. ООП. Классы</b>
        <ul>
            <li>Классы</li>
            <li>Приватные поля и методы</li>
            <li>Статические поля и методы</li>
            <li>Свойства и методы доступа</li>
            <li>Наследование</li>
        </ul>
    </div>
    <div>
        <b>Глава 6. Массивы</b>
        <ul>
            <li>Создание массива и объект Array</li>
            <li>Массивы и spread-оператор</li>
            <li>Операции с массивами</li>
            <li>Наследование массивов</li>
        </ul>
    </div>
    <div>
        <b>Глава 7. Строки и регулярные выражения</b>
        <ul>
            <li>Строки и объект String</li>
            <li>Шаблоны строк</li>
            <li>Объект RegExp. Регулярные выражения</li>
            <li>Синтаксис регулярных выражений</li>
            <li>Квантификаторы в регулярных выражениях</li>
            <li>Поиск в строке</li>
            <li>Группы в регулярных выражениях</li>
            <li>Регулярные выражения в методах String</li>
        </ul>
    </div>
    <div>
        <b>Глава 8. Обработка ошибок</b>
        <ul>
            <li>Конструкция try..catch..finally</li>
            <li>Генерация ошибок и оператор throw</li>
            <li>Типы ошибок</li>
            <li>Обработка ошибок и стек вызова функций</li>
        </ul>
    </div>
    <div>
        <b>Глава 9. Встроенные объекты</b>
        <ul>
            <li>Объект Date. Работа с датами</li>
            <li>Объект Math. Математические операции</li>
            <li>Объект Number</li>
            <li>Символы</li>
            <li>Proxy</li>
        </ul>
    </div>
    <div>
        <b>Глава 10. Коллекции и итераторы</b>
        <ul>
            <li>Итераторы</li>
            <li>Генераторы</li>
            <li>Множества Set</li>
            <li>Map</li>
            <li>WeakSet</li>
            <li>WeakMap</li>
        </ul>
    </div>
    <div>
        <b>Глава 11. Работа с DOM</b>
        <ul>
            <li>Введение в DOM</li>
            <li>Свойства объекта document</li>
            <li>Поиск элементов на веб-странице</li>
            <li>Объект Node. Навигация по DOM</li>
            <li>Элементы</li>
            <li>Создание, добавление и удаление элементов</li>
            <li>Управление атрибутами элементов</li>
            <li>Управление стилем и классами элементов</li>
            <li>Создание своего элемента HTML</li>
        </ul>
    </div>
    <div>
        <b>Глава 12. События</b>
        <ul>
            <li>Введение в обработку событий</li>
            <li>Обработчики событий</li>
            <li>Передача данных в обработчик события. Объект Event</li>
            <li>Распространение событий</li>
            <li>События мыши</li>
            <li>События клавиатуры</li>
            <li>Программный вызов событий</li>
            <li>Определение своих событий</li>
        </ul>
    </div>
    <div>
        <b>Глава 13. Работа с формами</b>
        <ul>
            <li>Формы и их элементы</li>
            <li>Кнопки</li>
            <li>Текстовые поля</li>
            <li>Флажки и радиокнопки</li>
            <li>Список select</li>
            <li>Validation API. Валидация элементов формы</li>
            <li>Управление валидацией форм</li>
        </ul>
    </div>
    <div>
        <b>Глава 14. Работа с браузером и BOM</b>
        <ul>
            <li>Browser Object Model и объект window</li>
            <li>Диалоговые окна и поиск на странице</li>
            <li>Открытие, закрытие и позиционирование окон</li>
            <li>История браузера. History API</li>
            <li>Объект location</li>
            <li>Объект navigator. Получение информации о браузере</li>
            <li>Таймеры</li>
        </ul>
    </div>
    <div>
        <b>Глава 15. Форматы JSON и XML</b>
        <ul>
            <li>Работа с JSON</li>
            <li>Работа с XML</li>
        </ul>
    </div>
    <div>
        <b>Глава 16. Хранение данных</b>
        <ul>
            <li>Куки</li>
            <li>Web Storage</li>
        </ul>
    </div>
    <div>
        <b>Глава 17. Асинхронность, promise, async и await</b>
        <ul>
            <li>Асинхронные функции и коллбеки</li>
            <li>Введение в промисы</li>
            <li>Получение результата операции в Promise</li>
            <li>Обработка ошибок в Promise</li>
            <li>Создание цепочек промисовх</li>
            <li>Функции Promise.all, Promise.allSettled, Promise.any и Promise.race</li>
            <li>Async и await</li>
            <li>Асинхронные итераторы</li>
            <li>Асинхронные генераторы</li>
        </ul>
    </div>
    <div>
        <b>Глава 18. AJAX-запросы и XMLHttpRequest</b>
        <ul>
            <li>XMLHttpRequest и отправка ajax-запросов</li>
            <li>Загрузка HTML с помощью XMLHttpRequest</li>
            <li>Загрузка XML с помощью XMLHttpRequest</li>
            <li>Загрузка JSON с помощью XMLHttpRequest</li>
            <li>Отправка данных в ajax-запросе</li>
            <li>Отправка форм в ajax-запросе</li>
            <li>Promise в Ajax-запросах</li>
        </ul>
    </div>
    <div>
        <b>Глава 19. Fetch API</b>
        <ul>
            <li>Функция fetch</li>
            <li>Объект Response и его свойства</li>
            <li>Получение данных из ответа</li>
            <li>Настройка параметров запроса. Отправка данных</li>
            <li>Создание клиента для REST API</li>
        </ul>
    </div>
    <div>
        <b>Глава 20. Web Socket API и Server-Sent Events</b>
        <ul>
            <li>Web Socket API</li>
            <li>Server-Sent Events</li>
        </ul>
    </div>
</div>